public class Homework_2_2 {
    public static void main(String [] args) {
        // Задача 11.1. Заголовки

         // скобки [] - включительно
        // скобки () - не включительно
        System.out.println("скобки [] - включительно; скобки () - не включительно");
        System.out.println("1. for (int i = 1; i <=34; i++)" +
                           " - 1) от [1;34] инкременитируется " +
                           "2) 34 раза выполнится");
        System.out.println("2. for (int i = 15; i <=34; i++)" +
                " - 1) от [15;34] инкременитируется " +
                "2) 19 раз выполнится");
        System.out.println("3. for (int i = 21; i <=34; i++)" +
                " - 1) от [21;34] инкременитируется " +
                "2) 13 раза выполнится");
        System.out.println("4. for (int i = 1; i <=34; i+=3)" +
                " - 1) от [1;34] увеличивается на 3 " +
                "2) 12 раза выполнится");
        System.out.println("5. for (int i = 17; i < 77; i += 10)" +
                " - 1) от [17;77) увеличивается на 10 " +
                "2) 6 раз выполнится");
        System.out.println("6. for (int i = 1; i <= 9; i += 2)" +
                " - 1) от [1;9) увеличивается на 2 " +
                "2) 5 раз выполнится");
        System.out.println("7. for (int i = 19; i >= 1; i--)" +
                " - 1) от [19;1] декрементируется " +
                "2) 19 раз выполнится");
        System.out.println("8. for (int i = 19; i >= 9; i--)" +
                " - 1) от [19;9] декрементируется " +
                "2) 11 раз выполнится");
        System.out.println("9. for (int i = 29; i > 10; i--)" +
                " - 1) от [29;10) декрементируется " +
                "2) 19 раз выполнится");
        System.out.println("10. for (int i = 9; i >= 1; i -= 4)" +
                " - 1) от [9;1] уменьается на 4 " +
                "2) 3 раз выполнится");
        System.out.println("11. for (int i = 99; i >= 0; i -= 10)" +
                " - 1) от [99;0] уменьшается на 10 " +
                "2) 10 раз выполнится");

        // Задача 11.13.


    }
}
